@extends('layouts.app')

@section('title', 'التقرير اليومي — منصة افتتاح الفروع')

@section('content')
@section('headerStyle')
style="height:300px !important;"
@endsection
<div class="sub_content">
  <h1>التقرير اليومي | الطازج | فرايد تشيكن</h1>
  <p>الرئيسية <img src="/images/SVG/arrow.svg" style="margin: 0 5px; width: 7px;" /> الطازج | فرايد
    تشيكن
    <img src="/images/SVG/arrow.svg" style="margin: 0 5px; width: 7px;" /> التقرير اليومي
  </p>
</div>
<div class="overlay"></div>
</header>
<section class="py-5 bg-light">
  <div class="container">
    <div class="row g-4 mb-4">

      <div class="col-md-4">
        <div class="card text-white" style="background:#d94a4a; position:relative; height: 200px;">
          <div class="card-body d-flex flex-column justify-content-between align-items-start p-4">
            <span><svg width="50" height="50" viewBox="0 0 50 50" fill="none"
                xmlns="http://www.w3.org/2000/svg">
                <path d="M50 0V50H0V0H50Z" fill="white" fill-opacity="0.01" />
                <g opacity="0.3">
                  <path
                    d="M6.25 13.1936C6.25 12.8524 6.58525 12.6049 6.91501 12.6928C9.21221 13.3053 17.1061 14.9666 25 11.4583C32.8661 7.96228 40.7322 9.59957 43.0605 10.2172C43.4766 10.3275 43.75 10.7069 43.75 11.1374V36.8062C43.75 37.1475 43.4148 37.3949 43.085 37.307C40.7878 36.6945 32.8939 35.0333 25 38.5416C17.1339 42.0375 9.26779 40.4003 6.93948 39.7827C6.52343 39.6723 6.25 39.2929 6.25 38.8625V13.1936Z"
                    fill="white" />
                  <path
                    d="M31.25 25C31.25 28.4518 28.4518 31.25 25 31.25C21.5482 31.25 18.75 28.4518 18.75 25C18.75 21.5483 21.5482 18.75 25 18.75C28.4518 18.75 31.25 21.5483 31.25 25Z"
                    fill="white" />
                </g>
                <path
                  d="M6.25 13.1936C6.25 12.8524 6.58525 12.6049 6.91501 12.6928C9.21221 13.3053 17.1061 14.9666 25 11.4583C32.8661 7.96228 40.7322 9.59957 43.0605 10.2172C43.4766 10.3275 43.75 10.7069 43.75 11.1374V36.8062C43.75 37.1475 43.4148 37.3949 43.085 37.307C40.7878 36.6945 32.8939 35.0333 25 38.5416C17.1339 42.0375 9.26779 40.4003 6.93948 39.7827C6.52343 39.6723 6.25 39.2929 6.25 38.8625V13.1936Z"
                  stroke="white" stroke-width="1.5" />
                <path
                  d="M31.25 25C31.25 28.4518 28.4518 31.25 25 31.25C21.5482 31.25 18.75 28.4518 18.75 25C18.75 21.5483 21.5482 18.75 25 18.75C28.4518 18.75 31.25 21.5483 31.25 25Z"
                  stroke="white" stroke-width="1.5" />
              </svg>

            </span>
            <div class="d-flex flex-column">
              <h2 class="fw-bold mb-2">{{ $totalBuy }} <svg width="15" height="16" viewBox="0 0 15 16"
                  fill="#fff" xmlns="http://www.w3.org/2000/svg">
                  <path fill="#fff"
                    d="M9.594 14.1741C9.33854 14.7405 9.16967 15.3553 9.10498 15.9999L14.511 14.8507C14.7665 14.2844 14.9352 13.6695 15 13.0249L9.594 14.1741Z"
                    fill="black" />
                  <path fill="#fff"
                    d="M14.5107 11.4079C14.7662 10.8416 14.935 10.2268 14.9997 9.58212L10.7886 10.4778V8.75601L14.5106 7.96505C14.766 7.39872 14.9349 6.78388 14.9996 6.13924L10.7885 7.03412V0.842159C10.1432 1.20447 9.57013 1.68674 9.1043 2.25561V7.39223L7.42013 7.75021V0C6.77486 0.362181 6.20179 0.844579 5.73596 1.41345V8.10806L1.96762 8.90883C1.71216 9.47515 1.54317 10.09 1.47835 10.7346L5.73596 9.82982V11.9981L1.1731 12.9677C0.917637 13.534 0.748775 14.1489 0.684082 14.7935L5.46012 13.7785C5.84891 13.6977 6.18307 13.4678 6.40033 13.1515L7.27622 11.8529V11.8526C7.36715 11.7183 7.42013 11.5563 7.42013 11.3818V9.47184L9.1043 9.11386V12.5574L14.5106 11.4077L14.5107 11.4079Z"
                    fill="black" />
                </svg>
              </h2>
              <div>مبيعات اليوم</div>
            </div>
          </div>
        </div>
      </div>
      <div class="col-md-4">
        <div class="card text-white" style="background:#267D69; position:relative; height: 200px;">
          <div class="card-body d-flex flex-column justify-content-between align-items-start p-4">
            <span><svg width="50" height="50" viewBox="0 0 50 50" fill="none"
                xmlns="http://www.w3.org/2000/svg">
                <path d="M50 0V50H0V0H50Z" fill="white" fill-opacity="0.01" />
                <path opacity="0.3"
                  d="M43.75 25C43.75 35.3553 35.3553 43.75 25 43.75C14.6447 43.75 6.25 35.3553 6.25 25C6.25 14.6447 14.6447 6.25 25 6.25C35.3553 6.25 43.75 14.6447 43.75 25Z"
                  fill="white" />
                <path
                  d="M18.7439 29.1596L18.7439 18.7429L29.1606 18.7429M18.75 18.7501L31.25 31.2501M43.75 25C43.75 35.3553 35.3553 43.75 25 43.75C14.6447 43.75 6.25 35.3553 6.25 25C6.25 14.6447 14.6447 6.25 25 6.25C35.3553 6.25 43.75 14.6447 43.75 25Z"
                  stroke="white" stroke-width="1.5" stroke-linecap="round"
                  stroke-linejoin="round" />
              </svg>

            </span>
            <div class="d-flex flex-column">
              <h2 class="fw-bold mb-2">{{ $totalSell }} <svg width="15" height="16" viewBox="0 0 15 16"
                  fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path fill="#fff"
                    d="M9.594 14.1741C9.33854 14.7405 9.16967 15.3553 9.10498 15.9999L14.511 14.8507C14.7665 14.2844 14.9352 13.6695 15 13.0249L9.594 14.1741Z"
                    fill="black" />
                  <path fill="#fff"
                    d="M14.5107 11.4079C14.7662 10.8416 14.935 10.2268 14.9997 9.58212L10.7886 10.4778V8.75601L14.5106 7.96505C14.766 7.39872 14.9349 6.78388 14.9996 6.13924L10.7885 7.03412V0.842159C10.1432 1.20447 9.57013 1.68674 9.1043 2.25561V7.39223L7.42013 7.75021V0C6.77486 0.362181 6.20179 0.844579 5.73596 1.41345V8.10806L1.96762 8.90883C1.71216 9.47515 1.54317 10.09 1.47835 10.7346L5.73596 9.82982V11.9981L1.1731 12.9677C0.917637 13.534 0.748775 14.1489 0.684082 14.7935L5.46012 13.7785C5.84891 13.6977 6.18307 13.4678 6.40033 13.1515L7.27622 11.8529V11.8526C7.36715 11.7183 7.42013 11.5563 7.42013 11.3818V9.47184L9.1043 9.11386V12.5574L14.5106 11.4077L14.5107 11.4079Z"
                    fill="black" />
                </svg>
              </h2>
              <div>مصروفات اليوم</div>
            </div>
          </div>
        </div>
      </div>
      <div class="col-md-4">
        <div class="card text-white" style="background:#3E5F7D; position:relative; height: 200px;">
          <div class="card-body d-flex flex-column justify-content-between align-items-start p-4">
            <span><svg width="50" height="50" viewBox="0 0 50 50" fill="none"
                xmlns="http://www.w3.org/2000/svg">
                <path d="M0 50V0H50V50H0Z" fill="white" fill-opacity="0.01" />
                <path opacity="0.3" fill-rule="evenodd" clip-rule="evenodd"
                  d="M26.042 22.9173L31.2505 22.9171L31.2505 19.1814C31.2505 16.3975 34.6163 15.0031 36.585 16.9715L46.5723 26.9566C47.7929 28.177 47.793 30.1559 46.5724 31.3764L36.5851 41.3623C34.6164 43.3307 31.2505 41.9364 31.2505 39.1524V35.4168H26.0421C24.8915 35.4168 23.9588 34.4841 23.9588 33.3335V27.084L18.7512 27.0843L18.7512 30.8199C18.7512 33.6038 15.3855 34.9982 13.4168 33.0299L3.42949 23.0448C2.20882 21.8244 2.20878 19.8454 3.4294 18.6249L13.4167 8.63905C15.3854 6.67062 18.7512 8.06494 18.7512 10.8489V14.5845H23.9586C25.1092 14.5845 26.0419 15.5172 26.0419 16.6678L26.042 22.9173Z"
                  fill="white" />
                <path
                  d="M26.042 33.3335H33.3337L33.3337 40.46C33.3337 40.9054 33.8723 41.1285 34.1873 40.8136L45.4823 29.5201C45.6776 29.3248 45.6776 29.0082 45.4823 28.8129L34.1872 17.5203C33.8722 17.2054 33.3337 17.4285 33.3337 17.8739L33.3337 25.0003L16.6678 25.001L16.6678 32.1274C16.6678 32.5729 16.1292 32.796 15.8143 32.481L4.51921 21.1884C4.32391 20.9932 4.3239 20.6765 4.5192 20.4813L15.8142 9.18777C16.1292 8.87282 16.6678 9.09591 16.6678 9.54135V16.6679H23.9584"
                  stroke="white" stroke-width="1.5" stroke-linecap="round"
                  stroke-linejoin="round" />
              </svg></span>
            <div class="d-flex flex-column">
              <h2 class="fw-bold mb-2">8%</h2>
              <div>صافي اليوم</div>
            </div>
          </div>
        </div>
      </div>
    </div>

    <!-- فرصك المشتركة بها Table -->
    <div class="mb-5 mt-5">
      <div class="d-flex align-items-start mb-4 gap-2">
        <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M40 0V40H0V0H40Z" fill="white" fill-opacity="0.01" />
          <circle opacity="0.3" cx="20.0002" cy="19.9999" r="16.6667" fill="#1E4262" />
          <path
            d="M6.6665 19.9491L9.55296 19.1958C9.64813 19.171 9.71822 19.284 9.65365 19.3582L5.67883 23.9261C5.62665 23.9861 5.5289 23.9641 5.50826 23.8874C5.32778 23.2164 5.19588 22.5388 5.1113 21.8593C4.38896 16.0564 7.11688 10.1166 12.4995 7.00895C19.6738 2.86681 28.8477 5.32494 32.9898 12.4993C37.132 19.6737 34.6738 28.8476 27.4995 32.9897C21.6879 36.345 14.5644 35.3694 9.86607 31.0644M19.9999 11.6667V20.0001L24.9999 25.0001"
            stroke="#1E4262" stroke-linecap="round" stroke-linejoin="round" />
        </svg>

        <div class="d-flex flex-column">
          <h5 class="fw-bold mb-2">تفاصيل العمليات</h5>
          <span class="text-muted" style="font-size:0.95rem;">قائمة بكل العمليات التي تمت في فرع الشركة
            الحالي</span>
        </div>
      </div>
      <div class="table-responsive">
        <table class="table rounded-3 shadow-sm align-middle">
          <thead>
            <tr>
              <th>وصف العملية</th>
              <th>النوع</th>
              <th>تاريخ العملية</th>
              <th>المبلغ</th>
            </tr>
          </thead>
          <tbody>
            @foreach($dailyReorts as $report)
            <tr>
              <td>
                <span class="ms-2">{{ $report->desc }}</span>
              </td>
              <td>{{ $report->type == 0 ? 'بيع' : 'شراء' }}</td>
              <td>{{ $report->created_at->format('Y-m-d h:i a') }}</td>

              <td>{{ $report->amount }} <svg width="15" height="16" viewBox="0 0 15 16" fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M9.594 14.1741C9.33854 14.7405 9.16967 15.3553 9.10498 15.9999L14.511 14.8507C14.7665 14.2844 14.9352 13.6695 15 13.0249L9.594 14.1741Z"
                    fill="black" />
                  <path
                    d="M14.5107 11.4079C14.7662 10.8416 14.935 10.2268 14.9997 9.58212L10.7886 10.4778V8.75601L14.5106 7.96505C14.766 7.39872 14.9349 6.78388 14.9996 6.13924L10.7885 7.03412V0.842159C10.1432 1.20447 9.57013 1.68674 9.1043 2.25561V7.39223L7.42013 7.75021V0C6.77486 0.362181 6.20179 0.844579 5.73596 1.41345V8.10806L1.96762 8.90883C1.71216 9.47515 1.54317 10.09 1.47835 10.7346L5.73596 9.82982V11.9981L1.1731 12.9677C0.917637 13.534 0.748775 14.1489 0.684082 14.7935L5.46012 13.7785C5.84891 13.6977 6.18307 13.4678 6.40033 13.1515L7.27622 11.8529V11.8526C7.36715 11.7183 7.42013 11.5563 7.42013 11.3818V9.47184L9.1043 9.11386V12.5574L14.5106 11.4077L14.5107 11.4079Z"
                    fill="black" />
                </svg>
              </td>

            </tr>
            @endforeach
          </tbody>
        </table>
      </div>
    </div>

    <!-- عمليات المحفظة Table -->
    <!-- <div>
      <div class="d-flex align-items-start mb-4 gap-2">
        <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M40 0V40H0V0H40Z" fill="white" fill-opacity="0.01" />
          <path opacity="0.3"
            d="M8.33317 8.33325H31.6665C32.587 8.33325 33.3332 9.07944 33.3332 9.99992V14.9999C34.2536 14.9999 34.9998 15.7461 34.9998 16.6666V23.3333C34.9998 24.2537 34.2536 24.9999 33.3332 24.9999V29.9999C33.3332 30.9204 32.587 31.6666 31.6665 31.6666H8.33317C7.4127 31.6666 6.6665 30.9204 6.6665 29.9999V9.99992C6.6665 9.07944 7.4127 8.33325 8.33317 8.33325Z"
            fill="#1E4262" />
          <path
            d="M26.6665 19.4999C26.3904 19.4999 26.1665 19.7238 26.1665 19.9999C26.1665 20.2761 26.3904 20.4999 26.6665 20.4999V19.9999V19.4999ZM26.6698 20.4999C26.9459 20.4999 27.1698 20.2761 27.1698 19.9999C27.1698 19.7238 26.9459 19.4999 26.6698 19.4999V19.9999V20.4999ZM7.6665 8.33325V8.83325H32.3332V8.33325V7.83325H7.6665V8.33325ZM32.3332 31.6666V31.1666H7.6665V31.6666V32.1666H32.3332V31.6666ZM6.6665 30.6666H7.1665V9.33325H6.6665H6.1665V30.6666H6.6665ZM33.3332 9.33325H32.8332V16.6666H33.3332H33.8332V9.33325H33.3332ZM33.3332 24.9999H32.8332V30.6666H33.3332H33.8332V24.9999H33.3332ZM23.9998 14.9999V15.4999H33.9998V14.9999V14.4999H23.9998V14.9999ZM34.9998 15.9999H34.4998V23.9999H34.9998H35.4998V15.9999H34.9998ZM33.9998 24.9999V24.4999H23.9998V24.9999V25.4999H33.9998V24.9999ZM19.9998 20.9999H20.4998V18.9999H19.9998H19.4998V20.9999H19.9998ZM26.6665 19.9999V20.4999H26.6698V19.9999V19.4999H26.6665V19.9999ZM23.9998 24.9999V24.4999C22.0668 24.4999 20.4998 22.9329 20.4998 20.9999H19.9998H19.4998C19.4998 23.4852 21.5146 25.4999 23.9998 25.4999V24.9999ZM34.9998 23.9999H34.4998C34.4998 24.2761 34.276 24.4999 33.9998 24.4999V24.9999V25.4999C34.8283 25.4999 35.4998 24.8283 35.4998 23.9999H34.9998ZM33.9998 14.9999V15.4999C34.276 15.4999 34.4998 15.7238 34.4998 15.9999H34.9998H35.4998C35.4998 15.1715 34.8283 14.4999 33.9998 14.4999V14.9999ZM7.6665 31.6666V31.1666C7.39036 31.1666 7.1665 30.9427 7.1665 30.6666H6.6665H6.1665C6.1665 31.495 6.83808 32.1666 7.6665 32.1666V31.6666ZM32.3332 31.6666V32.1666C33.1616 32.1666 33.8332 31.495 33.8332 30.6666H33.3332H32.8332C32.8332 30.9427 32.6093 31.1666 32.3332 31.1666V31.6666ZM23.9998 14.9999V14.4999C21.5146 14.4999 19.4998 16.5146 19.4998 18.9999H19.9998H20.4998C20.4998 17.0669 22.0668 15.4999 23.9998 15.4999V14.9999ZM32.3332 8.33325V8.83325C32.6093 8.83325 32.8332 9.05711 32.8332 9.33325H33.3332H33.8332C33.8332 8.50483 33.1616 7.83325 32.3332 7.83325V8.33325ZM7.6665 8.33325V7.83325C6.83808 7.83325 6.1665 8.50483 6.1665 9.33325H6.6665H7.1665C7.1665 9.05711 7.39036 8.83325 7.6665 8.83325V8.33325Z"
            fill="#1E4262" />
        </svg>

        <div class="d-flex flex-column">
          <h5 class="fw-bold mb-2">عمليات المحفظة</h5>
          <span class="text-muted" style="font-size:0.95rem;">قائمة بكل العمليات التي تمت من الإدارة إلى
            حسابك</span>
        </div>
      </div>
      <div class="table-responsive">
        <table class="table rounded-3 shadow-sm align-middle">
          <thead>
            <tr>
              <th>وصف العملية</th>
              <th>تاريخ العملية</th>
              <th>المبلغ</th>
              <th>إجراءات</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>آخر توزيع أرباح لاستثمارك في الطازج | فرايد تشيكن</td>
              <td>الثلاثاء، 20 يناير 2025</td>
              <td>8,550 ر.س</td>
              <td>
                <a href="#" class="btn btn-sm btn-outline-primary">تفاصيل</a>
              </td>
            </tr>
            <tr>
              <td>آخر توزيع أرباح لاستثمارك في بايلاسن فندق ومراتنا</td>
              <td>الثلاثاء، 20 يناير 2025</td>
              <td>8,250 ر.س</td>
              <td>
                <a href="#" class="btn btn-sm btn-outline-primary">تفاصيل</a>
              </td>
            </tr>
            <tr>
              <td>آخر توزيع أرباح لاستثمارك في مرسول | تطبيق جوال</td>
              <td>الثلاثاء، 20 يناير 2025</td>
              <td>9,050 ر.س</td>
              <td>
                <a href="#" class="btn btn-sm btn-outline-primary">تفاصيل</a>
              </td>
            </tr>
          </tbody>
        </table>
      </div>
    </div> -->
  </div>
</section>

@endsection