@extends('layouts.app')

@section('title', 'لوحة المستثمر — منصة افتتاح الفروع')

@section('content')

<div class="sub_content">
            <img src="{{ asset('images/dash-logo.png') }}" style="margin-top: 90px; width: 100px; height: 100px; border-radius: 10px;" />
            <h1>فهد الرشيدي</h1>
            <p>الرئيسية <img src="{{ asset('images/SVG/arrow.svg') }}" style="margin: 0 5px; width: 7px;" /> حسابى
                <img src="{{ asset('images/SVG/arrow.svg') }}" style="margin: 0 5px; width: 7px;" /> لوحة التحكم
            </p>
        </div>
        <div class="overlay"></div>

    </header>

    <!-- content -->
    <!-- Dashboard Summary Cards -->
    <section class="py-5 bg-light">
        <div class="container">
            <div class="row g-4 mb-4">

                <div class="col-md-4">
                    <div class="card text-white" style="background:#d94a4a; position:relative; height: 200px;">
                        <div class="card-body d-flex flex-column justify-content-between align-items-start p-4">
                            <span><svg width="50" height="50" viewBox="0 0 50 50" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path d="M50 0V50H0V0H50Z" fill="white" fill-opacity="0.01" />
                                    <path opacity="0.3"
                                        d="M43.75 25C43.75 35.3553 35.3553 43.75 25 43.75C14.6447 43.75 6.25 35.3553 6.25 25C6.25 14.6447 14.6447 6.25 25 6.25C35.3553 6.25 43.75 14.6447 43.75 25Z"
                                        fill="white" />
                                    <path
                                        d="M18.7439 29.1596L18.7439 18.7429L29.1606 18.7429M18.75 18.7501L31.25 31.2501M43.75 25C43.75 35.3553 35.3553 43.75 25 43.75C14.6447 43.75 6.25 35.3553 6.25 25C6.25 14.6447 14.6447 6.25 25 6.25C35.3553 6.25 43.75 14.6447 43.75 25Z"
                                        stroke="white" stroke-width="1.5" stroke-linecap="round"
                                        stroke-linejoin="round" />
                                </svg>
                            </span>
                            <div class="d-flex flex-column">
                                <h2 class="fw-bold mb-2">{{ number_format($totalAmount, 2) }} ر.س <svg width="15" height="16" viewBox="0 0 15 16"
                                        fill="#fff" xmlns="http://www.w3.org/2000/svg">
                                        <path fill="#fff"
                                            d="M9.594 14.1741C9.33854 14.7405 9.16967 15.3553 9.10498 15.9999L14.511 14.8507C14.7665 14.2844 14.9352 13.6695 15 13.0249L9.594 14.1741Z"
                                            fill="black" />
                                        <path fill="#fff"
                                            d="M14.5107 11.4079C14.7662 10.8416 14.935 10.2268 14.9997 9.58212L10.7886 10.4778V8.75601L14.5106 7.96505C14.766 7.39872 14.9349 6.78388 14.9996 6.13924L10.7885 7.03412V0.842159C10.1432 1.20447 9.57013 1.68674 9.1043 2.25561V7.39223L7.42013 7.75021V0C6.77486 0.362181 6.20179 0.844579 5.73596 1.41345V8.10806L1.96762 8.90883C1.71216 9.47515 1.54317 10.09 1.47835 10.7346L5.73596 9.82982V11.9981L1.1731 12.9677C0.917637 13.534 0.748775 14.1489 0.684082 14.7935L5.46012 13.7785C5.84891 13.6977 6.18307 13.4678 6.40033 13.1515L7.27622 11.8529V11.8526C7.36715 11.7183 7.42013 11.5563 7.42013 11.3818V9.47184L9.1043 9.11386V12.5574L14.5106 11.4077L14.5107 11.4079Z"
                                            fill="black" />
                                    </svg>
                                </h2>
                                <div>إجمالى المدفوع</div>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="col-md-4">
                    <div class="card text-white" style="background:#267D69; position:relative; height: 200px;">
                        <div class="card-body d-flex flex-column justify-content-between align-items-start p-4">
                            <span><svg width="50" height="50" viewBox="0 0 50 50" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path d="M0 50V0H50V50H0Z" fill="white" fill-opacity="0.01" />
                                    <path opacity="0.3"
                                        d="M6.25 25C6.25 14.6447 14.6447 6.25 25 6.25C35.3553 6.25 43.75 14.6447 43.75 25C43.75 35.3553 35.3553 43.75 25 43.75C14.6447 43.75 6.25 35.3553 6.25 25Z"
                                        fill="white" />
                                    <path
                                        d="M31.2561 20.8404L31.2561 31.2571L20.8394 31.2571M31.25 31.2499L18.75 18.7499M6.25 25C6.25 14.6447 14.6447 6.25 25 6.25C35.3553 6.25 43.75 14.6447 43.75 25C43.75 35.3553 35.3553 43.75 25 43.75C14.6447 43.75 6.25 35.3553 6.25 25Z"
                                        stroke="white" stroke-width="1.5" stroke-linecap="round"
                                        stroke-linejoin="round" />
                                </svg>
                            </span>
                            <div class="d-flex flex-column">
                                <h2 class="fw-bold mb-2">{{ number_format($totalRecieved, 2) }} ر.س <svg width="15" height="16" viewBox="0 0 15 16"
                                        fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path fill="#fff"
                                            d="M9.594 14.1741C9.33854 14.7405 9.16967 15.3553 9.10498 15.9999L14.511 14.8507C14.7665 14.2844 14.9352 13.6695 15 13.0249L9.594 14.1741Z"
                                            fill="black" />
                                        <path fill="#fff"
                                            d="M14.5107 11.4079C14.7662 10.8416 14.935 10.2268 14.9997 9.58212L10.7886 10.4778V8.75601L14.5106 7.96505C14.766 7.39872 14.9349 6.78388 14.9996 6.13924L10.7885 7.03412V0.842159C10.1432 1.20447 9.57013 1.68674 9.1043 2.25561V7.39223L7.42013 7.75021V0C6.77486 0.362181 6.20179 0.844579 5.73596 1.41345V8.10806L1.96762 8.90883C1.71216 9.47515 1.54317 10.09 1.47835 10.7346L5.73596 9.82982V11.9981L1.1731 12.9677C0.917637 13.534 0.748775 14.1489 0.684082 14.7935L5.46012 13.7785C5.84891 13.6977 6.18307 13.4678 6.40033 13.1515L7.27622 11.8529V11.8526C7.36715 11.7183 7.42013 11.5563 7.42013 11.3818V9.47184L9.1043 9.11386V12.5574L14.5106 11.4077L14.5107 11.4079Z"
                                            fill="black" />
                                    </svg>
                                </h2>
                                <div>إجمالى المقبوض</div>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="col-md-4">
                    <div class="card text-white" style="background:#3E5F7D; position:relative; height: 200px;">
                        <div class="card-body d-flex flex-column justify-content-between align-items-start p-4">
                            <span><svg width="50" height="50" viewBox="0 0 50 50" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path d="M0 50V0H50V50H0Z" fill="white" fill-opacity="0.01" />
                                    <path opacity="0.3" fill-rule="evenodd" clip-rule="evenodd"
                                        d="M26.042 22.9173L31.2505 22.9171L31.2505 19.1814C31.2505 16.3975 34.6163 15.0031 36.585 16.9715L46.5723 26.9566C47.7929 28.177 47.793 30.1559 46.5724 31.3764L36.5851 41.3623C34.6164 43.3307 31.2505 41.9364 31.2505 39.1524V35.4168H26.0421C24.8915 35.4168 23.9588 34.4841 23.9588 33.3335V27.084L18.7512 27.0843L18.7512 30.8199C18.7512 33.6038 15.3855 34.9982 13.4168 33.0299L3.42949 23.0448C2.20882 21.8244 2.20878 19.8454 3.4294 18.6249L13.4167 8.63905C15.3854 6.67062 18.7512 8.06494 18.7512 10.8489V14.5845H23.9586C25.1092 14.5845 26.0419 15.5172 26.0419 16.6678L26.042 22.9173Z"
                                        fill="white" />
                                    <path
                                        d="M26.042 33.3335H33.3337L33.3337 40.46C33.3337 40.9054 33.8723 41.1285 34.1873 40.8136L45.4823 29.5201C45.6776 29.3248 45.6776 29.0082 45.4823 28.8129L34.1872 17.5203C33.8722 17.2054 33.3337 17.4285 33.3337 17.8739L33.3337 25.0003L16.6678 25.001L16.6678 32.1274C16.6678 32.5729 16.1292 32.796 15.8143 32.481L4.51921 21.1884C4.32391 20.9932 4.3239 20.6765 4.5192 20.4813L15.8142 9.18777C16.1292 8.87282 16.6678 9.09591 16.6678 9.54135V16.6679H23.9584"
                                        stroke="white" stroke-width="1.5" stroke-linecap="round"
                                        stroke-linejoin="round" />
                                </svg></span>
                            <div class="d-flex flex-column">
                                <h2 class="fw-bold mb-2">{{ $refundRate }}%</h2>
                                <div>نسبة الإسترداد</div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>

            <!-- فرصك المشتركة بها Table -->
            <div class="mb-5 mt-5">
                <div class="d-flex align-items-start mb-4 gap-2">
                    <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M40 0V40H0V0H40Z" fill="white" fill-opacity="0.01" />
                        <path opacity="0.3"
                            d="M36.6668 19.9999C36.6668 29.2047 29.2049 36.6666 20.0002 36.6666C10.7954 36.6666 3.3335 29.2047 3.3335 19.9999C3.3335 10.7952 10.7954 3.33325 20.0002 3.33325C29.2049 3.33325 36.6668 10.7952 36.6668 19.9999Z"
                            fill="#1E4262" />
                        <path
                            d="M14.3613 6.63713C14.6156 6.52966 14.7347 6.23633 14.6272 5.98196C14.5198 5.72759 14.2264 5.6085 13.9721 5.71598L14.1667 6.17655L14.3613 6.63713ZM34.284 26.028C34.3915 25.7737 34.2724 25.4803 34.0181 25.3728C33.7637 25.2654 33.4704 25.3845 33.3629 25.6388L33.8235 25.8334L34.284 26.028ZM20 5V4.5C19.7239 4.5 19.5 4.72386 19.5 5H20ZM35 20V20.5C35.2761 20.5 35.5 20.2761 35.5 20H35ZM20 20H19.5C19.5 20.2761 19.7239 20.5 20 20.5V20ZM20 35V34.5C11.9919 34.5 5.5 28.0082 5.5 20H5H4.5C4.5 28.5605 11.4396 35.5 20 35.5V35ZM5 20H5.5C5.5 13.9927 9.15325 8.83755 14.3613 6.63713L14.1667 6.17655L13.9721 5.71598C8.40694 8.06727 4.5 13.5768 4.5 20H5ZM33.8235 25.8334L33.3629 25.6388C31.1625 30.8468 26.0073 34.5 20 34.5V35V35.5C26.4232 35.5 31.9327 31.5931 34.284 26.028L33.8235 25.8334ZM35 20V19.5H20V20V20.5H35V20ZM20 20H20.5V5H20H19.5V20H20ZM20 5V5.5C28.0081 5.5 34.5 11.9919 34.5 20H35H35.5C35.5 11.4396 28.5604 4.5 20 4.5V5Z"
                            fill="#1E4262" />
                    </svg>
                    <div class="d-flex flex-column">
                        <h5 class="fw-bold mb-2">فرصى المشارك بها</h5>
                        <span class="text-muted" style="font-size:0.95rem;">قائمة بكل المشاركات المقدمة في كل
                            الفرص</span>
                    </div>
                </div>
                <div class="table-responsive">
                    <table class="table rounded-3 shadow-sm align-middle">
                        <thead>
                            <tr>
                                <th>اسم الفرصة</th>
                                <th>المدينة</th>
                                <th>مدفوع</th>
                                <th>مقبوض</th>
                                <th>نسبة الاسترداد</th>
                                <th>إجراءات</th>
                            </tr>
                        </thead>
                        <tbody>
                            @foreach($investments as $investment)
                            <tr>
                                <td>
                                    <img src="{{ asset('assets/images/Vector.png') }}" alt="الطازج"
                                        style="width:32px;vertical-align:middle;">
                                    <span class="ms-2"> {{ $investment->opportunity->title }}</span>
                                </td>
                                <td>{{ $investment->opportunity->city->name }}</td>
                                <td>{{ number_format($investment->amount_paid, 0) }} <svg width="15" height="16" viewBox="0 0 15 16" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M9.594 14.1741C9.33854 14.7405 9.16967 15.3553 9.10498 15.9999L14.511 14.8507C14.7665 14.2844 14.9352 13.6695 15 13.0249L9.594 14.1741Z"
                                            fill="black" />
                                        <path
                                            d="M14.5107 11.4079C14.7662 10.8416 14.935 10.2268 14.9997 9.58212L10.7886 10.4778V8.75601L14.5106 7.96505C14.766 7.39872 14.9349 6.78388 14.9996 6.13924L10.7885 7.03412V0.842159C10.1432 1.20447 9.57013 1.68674 9.1043 2.25561V7.39223L7.42013 7.75021V0C6.77486 0.362181 6.20179 0.844579 5.73596 1.41345V8.10806L1.96762 8.90883C1.71216 9.47515 1.54317 10.09 1.47835 10.7346L5.73596 9.82982V11.9981L1.1731 12.9677C0.917637 13.534 0.748775 14.1489 0.684082 14.7935L5.46012 13.7785C5.84891 13.6977 6.18307 13.4678 6.40033 13.1515L7.27622 11.8529V11.8526C7.36715 11.7183 7.42013 11.5563 7.42013 11.3818V9.47184L9.1043 9.11386V12.5574L14.5106 11.4077L14.5107 11.4079Z"
                                            fill="black" />
                                    </svg>
                                </td>
                                <td>{{ number_format($investment->amount_invested, 0) }} <svg width="15" height="16" viewBox="0 0 15 16" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M9.594 14.1741C9.33854 14.7405 9.16967 15.3553 9.10498 15.9999L14.511 14.8507C14.7665 14.2844 14.9352 13.6695 15 13.0249L9.594 14.1741Z"
                                            fill="black" />
                                        <path
                                            d="M14.5107 11.4079C14.7662 10.8416 14.935 10.2268 14.9997 9.58212L10.7886 10.4778V8.75601L14.5106 7.96505C14.766 7.39872 14.9349 6.78388 14.9996 6.13924L10.7885 7.03412V0.842159C10.1432 1.20447 9.57013 1.68674 9.1043 2.25561V7.39223L7.42013 7.75021V0C6.77486 0.362181 6.20179 0.844579 5.73596 1.41345V8.10806L1.96762 8.90883C1.71216 9.47515 1.54317 10.09 1.47835 10.7346L5.73596 9.82982V11.9981L1.1731 12.9677C0.917637 13.534 0.748775 14.1489 0.684082 14.7935L5.46012 13.7785C5.84891 13.6977 6.18307 13.4678 6.40033 13.1515L7.27622 11.8529V11.8526C7.36715 11.7183 7.42013 11.5563 7.42013 11.3818V9.47184L9.1043 9.11386V12.5574L14.5106 11.4077L14.5107 11.4079Z"
                                            fill="black" />
                                    </svg>
                                </td>
                                <td>{{ number_format($investment->received_amount / $investment->amount * 100, 2) }}%</td>
                                <td>
                                    <a href="{{ route('daily', 1) }}" class="btn btn-sm btn-outline-primary"><svg width="25" height="24"
                                            viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M24.5 0V24H0.5V0H24.5Z" fill="white" fill-opacity="0.01" />
                                            <path opacity="0.3"
                                                d="M5.5 20C5.5 20.5523 5.94772 21 6.5 21H14.0858C14.351 21 14.6054 20.8946 14.7929 20.7071L19.2071 16.2929C19.3946 16.1054 19.5 15.851 19.5 15.5858V4C19.5 3.44772 19.0523 3 18.5 3H6.5C5.94772 3 5.5 3.44772 5.5 4L5.5 20Z"
                                                fill="#1E4262" />
                                            <path
                                                d="M13.5 21V15.5C13.5 15.2239 13.7239 15 14 15L19.5 15M9.5 8L15.5 8M9.5 12H10.5M14.0858 21H6.5C5.94772 21 5.5 20.5523 5.5 20L5.5 4C5.5 3.44772 5.94772 3 6.5 3H18.5C19.0523 3 19.5 3.44772 19.5 4V15.5858C19.5 15.851 19.3946 16.1054 19.2071 16.2929L14.7929 20.7071C14.6054 20.8946 14.351 21 14.0858 21Z"
                                                stroke="#1E4262" stroke-width="1.5" stroke-linecap="round"
                                                stroke-linejoin="round" />
                                        </svg>
                                        التقرير</a>
                                </td>
                            </tr>
                            @endforeach
                        </tbody>
                    </table>
                </div>
            </div>

            <!-- عمليات المحفظة Table -->
            <div>
                <div class="d-flex align-items-start mb-4 gap-2">
                    <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M40 0V40H0V0H40Z" fill="white" fill-opacity="0.01"/>
<path opacity="0.3" d="M8.33317 8.33325H31.6665C32.587 8.33325 33.3332 9.07944 33.3332 9.99992V14.9999C34.2536 14.9999 34.9998 15.7461 34.9998 16.6666V23.3333C34.9998 24.2537 34.2536 24.9999 33.3332 24.9999V29.9999C33.3332 30.9204 32.587 31.6666 31.6665 31.6666H8.33317C7.4127 31.6666 6.6665 30.9204 6.6665 29.9999V9.99992C6.6665 9.07944 7.4127 8.33325 8.33317 8.33325Z" fill="#1E4262"/>
<path d="M26.6665 19.4999C26.3904 19.4999 26.1665 19.7238 26.1665 19.9999C26.1665 20.2761 26.3904 20.4999 26.6665 20.4999V19.9999V19.4999ZM26.6698 20.4999C26.9459 20.4999 27.1698 20.2761 27.1698 19.9999C27.1698 19.7238 26.9459 19.4999 26.6698 19.4999V19.9999V20.4999ZM7.6665 8.33325V8.83325H32.3332V8.33325V7.83325H7.6665V8.33325ZM32.3332 31.6666V31.1666H7.6665V31.6666V32.1666H32.3332V31.6666ZM6.6665 30.6666H7.1665V9.33325H6.6665H6.1665V30.6666H6.6665ZM33.3332 9.33325H32.8332V16.6666H33.3332H33.8332V9.33325H33.3332ZM33.3332 24.9999H32.8332V30.6666H33.3332H33.8332V24.9999H33.3332ZM23.9998 14.9999V15.4999H33.9998V14.9999V14.4999H23.9998V14.9999ZM34.9998 15.9999H34.4998V23.9999H34.9998H35.4998V15.9999H34.9998ZM33.9998 24.9999V24.4999H23.9998V24.9999V25.4999H33.9998V24.9999ZM19.9998 20.9999H20.4998V18.9999H19.9998H19.4998V20.9999H19.9998ZM26.6665 19.9999V20.4999H26.6698V19.9999V19.4999H26.6665V19.9999ZM23.9998 24.9999V24.4999C22.0668 24.4999 20.4998 22.9329 20.4998 20.9999H19.9998H19.4998C19.4998 23.4852 21.5146 25.4999 23.9998 25.4999V24.9999ZM34.9998 23.9999H34.4998C34.4998 24.2761 34.276 24.4999 33.9998 24.4999V24.9999V25.4999C34.8283 25.4999 35.4998 24.8283 35.4998 23.9999H34.9998ZM33.9998 14.9999V15.4999C34.276 15.4999 34.4998 15.7238 34.4998 15.9999H34.9998H35.4998C35.4998 15.1715 34.8283 14.4999 33.9998 14.4999V14.9999ZM7.6665 31.6666V31.1666C7.39036 31.1666 7.1665 30.9427 7.1665 30.6666H6.6665H6.1665C6.1665 31.495 6.83808 32.1666 7.6665 32.1666V31.6666ZM32.3332 31.6666V32.1666C33.1616 32.1666 33.8332 31.495 33.8332 30.6666H33.3332H32.8332C32.8332 30.9427 32.6093 31.1666 32.3332 31.1666V31.6666ZM23.9998 14.9999V14.4999C21.5146 14.4999 19.4998 16.5146 19.4998 18.9999H19.9998H20.4998C20.4998 17.0669 22.0668 15.4999 23.9998 15.4999V14.9999ZM32.3332 8.33325V8.83325C32.6093 8.83325 32.8332 9.05711 32.8332 9.33325H33.3332H33.8332C33.8332 8.50483 33.1616 7.83325 32.3332 7.83325V8.33325ZM7.6665 8.33325V7.83325C6.83808 7.83325 6.1665 8.50483 6.1665 9.33325H6.6665H7.1665C7.1665 9.05711 7.39036 8.83325 7.6665 8.83325V8.33325Z" fill="#1E4262"/>
</svg>

                    <div class="d-flex flex-column">
                        <h5 class="fw-bold mb-2">عمليات المحفظة</h5>
                        <span class="text-muted" style="font-size:0.95rem;">قائمة بكل العمليات التي تمت من الإدارة إلى حسابك</span>
                    </div>
                </div>
                <div class="table-responsive">
                    <table class="table rounded-3 shadow-sm align-middle">
                        <thead>
                            <tr>
                                <th>وصف العملية</th>
                                <th>تاريخ العملية</th>
                                <th>المبلغ</th>
                                <th>إجراءات</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>آخر توزيع أرباح لاستثمارك في الطازج | فرايد تشيكن</td>
                                <td>الثلاثاء، 20 يناير 2025</td>
                                <td>8,550 ر.س</td>
                                <td>
                                    <a href="#" class="btn btn-sm btn-outline-primary">تفاصيل</a>
                                </td>
                            </tr>
                            <tr>
                                <td>آخر توزيع أرباح لاستثمارك في بايلاسن فندق ومراتنا</td>
                                <td>الثلاثاء، 20 يناير 2025</td>
                                <td>8,250 ر.س</td>
                                <td>
                                    <a href="#" class="btn btn-sm btn-outline-primary">تفاصيل</a>
                                </td>
                            </tr>
                            <tr>
                                <td>آخر توزيع أرباح لاستثمارك في مرسول | تطبيق جوال</td>
                                <td>الثلاثاء، 20 يناير 2025</td>
                                <td>9,050 ر.س</td>
                                <td>
                                    <a href="#" class="btn btn-sm btn-outline-primary">تفاصيل</a>
                                </td>
                            </tr>
                        </tbody>
                    </table>
                </div>
            </div>
        </div>
    </section>
@endsection