@extends('layouts.app')

@section('title', 'الدعم — منصة افتتاح الفروع')

@section('content')

@if (session('success'))
        <div class="alert alert-success">
            {{ session('success') }}
        </div>
    @endif
<div class="sub_content">
            <h1>تواصل معنا</h1>
            <p>اذا كان لديك اي تساؤل او استفسار لا تتردد بالتواصل معنا
            </p>
        </div>
        <div class="overlay"></div>

    </header>

  <section class="section mt-4">
    <div class="row" style="margin: 0 20px; ">
      <div class="col-md-6">
        <div class="contact-channel rounded">
          <div class="content" style="border-radius: 20px;">
            <div class="prand mb-4">
              نموذج شفاف 👌
            </div>
            <h2 class="fw-bold">قنوات التواصل</h2>
            <p>قنوات التواصل الخاصة بمنصة شارك , يمكنك التواصل
              معنا في اي وقت 📞</p>


            <div class="contact-item" style=" background-color: #517594a8;">
              <div class="mb-2"> <svg width="45" height="44" viewBox="0 0 45 44" fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path d="M0.5 0V44H44.5V0H0.5Z" fill="white" fill-opacity="0.01" />
                  <path opacity="0.3"
                    d="M30.8154 30.3147C23.3728 37.7573 16.3662 38.6598 14.0868 38.7437C13.5705 38.7627 13.0625 38.6781 12.5612 38.5528L12.4257 38.5189C9.71864 37.8421 7.48361 35.9387 6.38442 33.3739C6.26046 33.0847 6.2964 32.7502 6.49007 32.5021C8.58294 29.8219 11.4984 27.9445 14.2667 26.0179C14.466 25.8792 14.7361 25.9027 14.9078 26.0744L18.2814 29.448C18.4154 29.582 18.6118 29.6288 18.7887 29.561C19.747 29.1938 22.9158 27.8434 25.6299 25.1293C28.3441 22.4151 29.6945 19.2463 30.0617 18.288C30.1295 18.1112 30.0826 17.9147 29.9487 17.7808L26.5744 14.4065C26.403 14.2351 26.3793 13.9656 26.5169 13.7661C28.4118 11.0182 30.2839 7.9507 33.009 5.96297C33.2544 5.78396 33.5766 5.75604 33.8558 5.8757C36.4324 6.97996 38.3446 9.22532 39.0245 11.9449L39.0534 12.0606C39.1788 12.5619 39.2633 13.0698 39.2443 13.5862C39.1604 15.8655 38.258 22.8721 30.8154 30.3147Z"
                    fill="white" />
                  <path
                    d="M30.8154 30.3147C23.3728 37.7573 16.3662 38.6598 14.0868 38.7437C13.5705 38.7627 13.0625 38.6781 12.5612 38.5528L12.4257 38.5189C9.71864 37.8421 7.48361 35.9387 6.38442 33.3739C6.26046 33.0847 6.2964 32.7502 6.49007 32.5021C8.58294 29.8219 11.4984 27.9445 14.2667 26.0179C14.466 25.8792 14.7361 25.9027 14.9078 26.0744L18.2814 29.448C18.4154 29.582 18.6118 29.6288 18.7887 29.561C19.747 29.1938 22.9158 27.8434 25.6299 25.1293C28.3441 22.4151 29.6945 19.2463 30.0617 18.288C30.1295 18.1112 30.0826 17.9147 29.9487 17.7808L26.5744 14.4065C26.403 14.2351 26.3793 13.9656 26.5169 13.7661C28.4118 11.0182 30.2839 7.9507 33.009 5.96297C33.2544 5.78396 33.5766 5.75604 33.8558 5.8757C36.4324 6.97996 38.3446 9.22532 39.0245 11.9449L39.0534 12.0606C39.1788 12.5619 39.2633 13.0698 39.2443 13.5862C39.1604 15.8655 38.258 22.8721 30.8154 30.3147Z"
                    stroke="white" stroke-width="1.5" />
                </svg>
              </div>
              <p class="fw-bold">+9665662154</p>
              <p>تواصل هاتفياً</p>



            </div>


            <div class="contact-item">
              <div class="mb-2"> <svg width="45" height="44" viewBox="0 0 45 44" fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path d="M0.5 0V44H44.5V0H0.5Z" fill="white" fill-opacity="0.01" />
                  <path opacity="0.3"
                    d="M39 17.0352C39 16.7008 38.8329 16.3886 38.5547 16.2031L23.0547 5.8698C22.7188 5.64587 22.2812 5.64587 21.9453 5.8698L6.4453 16.2031C6.1671 16.3886 6 16.7008 6 17.0352V35.6667C6 36.219 6.44772 36.6667 7 36.6667H38C38.5523 36.6667 39 36.219 39 35.6667V17.0352Z"
                    fill="white" />
                  <path
                    d="M39 16.5179L22.777 27.3152C22.6092 27.4269 22.3908 27.4269 22.223 27.3152L6 16.5179M23.0547 5.8698L38.5547 16.2031C38.8329 16.3886 39 16.7008 39 17.0352V35.6667C39 36.219 38.5523 36.6667 38 36.6667H7C6.44771 36.6667 6 36.219 6 35.6667V17.0352C6 16.7008 6.1671 16.3886 6.4453 16.2031L21.9453 5.8698C22.2812 5.64587 22.7188 5.64587 23.0547 5.8698Z"
                    stroke="white" stroke-width="1.5" />
                </svg>

              </div>
              <p class="fw-bold">Support@sharik.sa</p>
              <p>البريد الإلكتروني</p>



            </div>



            <div class="contact-item" style=" background-color: #517594a8;">
              <div class="mb-2"> <svg width="45" height="44" viewBox="0 0 45 44" fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path d="M44.5 0V44H0.5V0H44.5Z" fill="white" fill-opacity="0.01" />
                  <path opacity="0.3"
                    d="M22.5 38.5C31.6127 38.5 39 31.1127 39 22C39 12.8873 31.6127 5.5 22.5 5.5C13.3873 5.5 6 12.8873 6 22C6 25.3192 6.98008 28.4095 8.66662 30.9973C8.74782 31.1219 8.7719 31.2755 8.72994 31.4182L6.91667 37.5833L13.0818 35.7701C13.2245 35.7281 13.3781 35.7522 13.5027 35.8334C16.0905 37.5199 19.1808 38.5 22.5 38.5Z"
                    fill="white" />
                  <path
                    d="M6.91667 37.5833L6.19714 37.3717C6.1197 37.635 6.19227 37.9196 6.38634 38.1137C6.58041 38.3077 6.86499 38.3803 7.12829 38.3029L6.91667 37.5833ZM13.0818 35.7701L13.2934 36.4896L13.0818 35.7701ZM13.5027 35.8334L13.9122 35.205L13.5027 35.8334ZM8.66662 30.9973L8.03829 31.4068L8.66662 30.9973ZM8.72994 31.4182L8.01042 31.2066L8.72994 31.4182ZM39 22H38.25C38.25 30.6985 31.1985 37.75 22.5 37.75V38.5V39.25C32.0269 39.25 39.75 31.5269 39.75 22H39ZM22.5 5.5V6.25C31.1985 6.25 38.25 13.3015 38.25 22H39H39.75C39.75 12.4731 32.0269 4.75 22.5 4.75V5.5ZM6 22H6.75C6.75 13.3015 13.8015 6.25 22.5 6.25V5.5V4.75C12.9731 4.75 5.25 12.4731 5.25 22H6ZM8.66662 30.9973L9.29496 30.5878C7.68539 28.1181 6.75 25.1694 6.75 22H6H5.25C5.25 25.469 6.27476 28.7009 8.03829 31.4068L8.66662 30.9973ZM6.91667 37.5833L7.63619 37.795L9.44946 31.6298L8.72994 31.4182L8.01042 31.2066L6.19714 37.3717L6.91667 37.5833ZM13.0818 35.7701L12.8702 35.0505L6.70504 36.8638L6.91667 37.5833L7.12829 38.3029L13.2934 36.4896L13.0818 35.7701ZM22.5 38.5V37.75C19.3306 37.75 16.3819 36.8146 13.9122 35.205L13.5027 35.8334L13.0932 36.4617C15.7991 38.2252 19.031 39.25 22.5 39.25V38.5ZM13.0818 35.7701L13.2934 36.4896C13.2202 36.5111 13.1476 36.4971 13.0932 36.4617L13.5027 35.8334L13.9122 35.205C13.6087 35.0072 13.2287 34.9451 12.8702 35.0505L13.0818 35.7701ZM8.66662 30.9973L8.03829 31.4068C8.00286 31.3524 7.98889 31.2798 8.01042 31.2066L8.72994 31.4182L9.44946 31.6298C9.55491 31.2713 9.49278 30.8913 9.29496 30.5878L8.66662 30.9973Z"
                    fill="white" />
                  <path
                    d="M18.8831 25.6166C15.336 22.0693 14.8999 18.7231 14.8594 17.6209C14.8498 17.3611 14.8933 17.1088 14.954 16.8662L14.9671 16.8116C15.2978 15.4889 16.2281 14.3967 17.4813 13.8596C17.6504 13.7871 17.8471 13.8035 17.9978 13.9135C19.1253 14.7359 19.9588 15.9555 20.7399 17.1099C20.8236 17.2335 20.9071 17.3565 20.9892 17.4766C21.1458 17.7058 21.1094 18.0147 20.905 18.2003L19.1144 19.5296C18.7381 19.8092 18.5971 20.3319 18.8285 20.7725C19.2143 21.5067 19.9798 22.7068 20.8863 23.6134C21.6797 24.4067 22.7396 25.1296 23.5117 25.5842L23.8239 25.7623C24.2843 26.0158 24.8434 25.8573 25.1179 25.4392L26.2932 23.6479C26.4724 23.4138 26.8042 23.361 27.0473 23.5291C27.1248 23.5828 27.203 23.6374 27.2814 23.6914C28.4618 24.5057 29.6764 25.3504 30.5718 26.4971C30.6903 26.6491 30.7125 26.8528 30.6374 27.0281C30.1026 28.2757 29.0153 29.2014 27.6985 29.5306L27.6342 29.5465C27.3916 29.6071 27.1393 29.6506 26.8795 29.6411C25.7773 29.6005 22.4306 29.1641 18.8831 25.6166Z"
                    fill="white" stroke="white" stroke-width="1.5" />
                </svg>


              </div>
              <p class="fw-bold">+9665662154</p>
              <p>واتساب</p>



            </div>



          </div>
          <div class="overlay"></div>
        </div>
      </div>
      <div class="col-md-6">
        <div class="container">
          <div class="d-flex justify-content-center align-items-center  flex-column">
            <img src="./assets/images/SVG/phone_contact.svg" style="width: 70px;" />
            <h2 class="">تواصل معنا 📞</h2>
            <p>قم بتعبئة النموذج الحالي للتواصل معنا</p>
          </div>
          <form method="POST" action="{{ route('support.store') }}">
            @csrf
            <!---->
            <div class="mb-4">
              <label class="form-label fw-bold">إسمك</label>
              <div class="input-group mb-3 details-amount-input">

                <span class="input-group-text" id="basic-addon1">
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M24 0V24H0V0H24Z" fill="white" fill-opacity="0.01" />
                    <g opacity="0.3">
                      <path
                        d="M20 18.5C20 20.433 16.4183 21 12 21C7.58172 21 4 20.433 4 18.5C4 16.567 7.58172 14 12 14C16.4183 14 20 16.567 20 18.5Z"
                        fill="#1E4262" />
                      <path
                        d="M16 7C16 9.20914 14.2091 11 12 11C9.79086 11 8 9.20914 8 7C8 4.79086 9.79086 3 12 3C14.2091 3 16 4.79086 16 7Z"
                        fill="#1E4262" />
                    </g>
                    <path
                      d="M20 18.5C20 20.433 16.4183 21 12 21C7.58172 21 4 20.433 4 18.5C4 16.567 7.58172 14 12 14C16.4183 14 20 16.567 20 18.5Z"
                      stroke="#1E4262" stroke-width="1.5" />
                    <path
                      d="M16 7C16 9.20914 14.2091 11 12 11C9.79086 11 8 9.20914 8 7C8 4.79086 9.79086 3 12 3C14.2091 3 16 4.79086 16 7Z"
                      stroke="#1E4262" stroke-width="1.5" />
                  </svg>
                </span>
                <input type="text" class="form-control" name="name" placeholder="اسمك بالكامل" aria-label="Search"
                  aria-describedby="basic-addon1">
              </div>



            </div>
           
               <!---->
            <div class="mb-4">
              <label class="form-label fw-bold">البريد الإلكتروني</label>
              <div class="input-group mb-3 details-amount-input">

                <span class="input-group-text" id="basic-addon1">
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M24 0V24H0V0H24Z" fill="white" fill-opacity="0.01"/>
<path opacity="0.3" d="M3 6C3 5.44772 3.44772 5 4 5H20C20.5523 5 21 5.44772 21 6V18C21 18.5523 20.5523 19 20 19H4C3.44772 19 3 18.5523 3 18V6Z" fill="#1E4262"/>
<path d="M3 6.5L11.6799 13.7333C11.8653 13.8878 12.1347 13.8878 12.3201 13.7333L21 6.5M4 19H20C20.5523 19 21 18.5523 21 18V6C21 5.44772 20.5523 5 20 5H4C3.44772 5 3 5.44772 3 6V18C3 18.5523 3.44772 19 4 19Z" stroke="#1E4262" stroke-width="1.5"/>
</svg>

                </span>
                <input type="text" class="form-control" name="email" placeholder="XXX@gmail.com" aria-label="Search"
                  aria-describedby="basic-addon1">
              </div>



            </div>

               <!---->
            <div class="mb-4">
              <label class="form-label fw-bold">موضوع الطلب</label>
              <div class="input-group mb-3 details-amount-input">

                <span class="input-group-text" id="basic-addon1">
               <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M24 0V24H0V0H24Z" fill="white" fill-opacity="0.01"/>
<path opacity="0.3" fill-rule="evenodd" clip-rule="evenodd" d="M3 6C3 5.44772 3.44772 5 4 5H20C20.5523 5 21 5.44772 21 6V18C21 18.5523 20.5523 19 20 19H4C3.44772 19 3 18.5523 3 18V6Z" fill="#1E4262"/>
<path d="M4 6H20M4 12H20M4 18H20" stroke="#1E4262" stroke-width="1.5" stroke-linecap="round"/>
</svg>

                </span>
                <input type="text" class="form-control" name="subject" placeholder="ادخل الموضوع ..." aria-label="Search"
                  aria-describedby="basic-addon1">
              </div>



            </div>
   <!---->
            <div class="mb-4">
              <label class="form-label fw-bold">تفاصيل الرسالة</label>
              <div class="input-group mb-3 details-amount-input">

                <span class="input-group-text" id="basic-addon1">
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M24 0V24H0V0H24Z" fill="white" fill-opacity="0.01"/>
<path opacity="0.3" fill-rule="evenodd" clip-rule="evenodd" d="M3 5C3 3.89543 3.89543 3 5 3H20C20.5523 3 21 3.44772 21 4V19C21 20.1046 20.1046 21 19 21H5C3.89543 21 3 20.1046 3 19V5Z" fill="#1E4262"/>
<path d="M20 11V19C20 19.5523 19.5523 20 19 20H5C4.44772 20 4 19.5523 4 19V5C4 4.44772 4.44772 4 5 4H13M20 4L10 14" stroke="#1E4262" stroke-width="1.5" stroke-linecap="round"/>
</svg>

                </span>
                <textarea type="text" class="form-control" name="details" placeholder="أكتب التفاصيل ..." aria-label="Search"
                  aria-describedby="basic-addon1"></textarea>
              </div>



            </div>

            <button class="btn card-btn btn-lg fs-6">إرسال</button>
          </form>
        </div>
      </div>
    </div>
  </section>
@endsection